import time

print('Привіт, ви потрапили у гру: "Загублені"')
print("Ви прокинулись на острові від жіночого крику. Ви налякані. Ваша ціль втекти з острова")
time.sleep(2)

while True:
    print("Ви знаходитесь на пляжі. У вас є три варіанти дороги:")
    print("1. Піти в глубину лісу, по стежині")
    print("2. Піти в сторону з якої лунав крик")
    print("3. Піти по узбережжю")
    
    a = input("Введіть свою відповідь (1/2/3): ")

    if a == '1':
        print("Ви потрапляєте в поселення аборигенів")
        print("Ви бачите навколо поселення голови людей на палицях. Ви вирішуєте повернутись поки вас не помітили")
        time.sleep(5)
        continue

    elif a == '2':
        print("Ви ідете в сторону крику")
        print("Ви бачите дівчину. Вона біжить у вашу сторону.")
        print("Вона просить вас допомогти їй втекти. На неї напали аборигени.")
        print("Вітаю! Тепер ви разом повинні втекти.")
        print("Дівчина радить вам тікати у сторону пляжу")
        time.sleep(5)
        continue

    elif a == '3':
        print("По дорозі ви побачили дівчину без свідомості. Ви тепер намагаєтесь разом втекти з острова")
        print("Ви вирішили триматись біля води")
        print("Ідучи по пляжу ви бачите маленький будиночок")
        print("Ви заходите в нього та починаєте обшукувати в пошуку їжі та чистої води")
        print("Ви піднялись на горище поки ваша компаньйонка шукає внизу")
        print("Ви відчуваєте дим який почався внизу")
        print("Ви маєте 2 варіанти відповіді")
        print("1. Стрибнути через маленьке віконце на горищі")
        print("2. Спробувати пробігти через вогонь")
        b = input("Введіть свою відповідь (1/2): ")
        time.sleep(2)

        if b == '1':
            print("Ви зламали руку.")
            print("Ви бачите як ваша спутниця тікає у протилежну сторону.")
            print("У вас є вибір:")
            print("1. бігти за нею")
            print("2. Тікати окремо")
        elif b == '2':
            print("Ви згоріли. Гра завершена")

        c = input("Введіть свою відповідь (1/2/3): ")
        
        if c == '1':
                print("Ви натрапили на свою спутницю в гущі лісу.")
                print("Вона почала поводити себе дивно. Та уникати відповіді на ваші запитання")
                print("Ви вирішуєте піти від неї. Вона з німим обличчям приймає ваше рішення")
                print("Ви ідете по пляжу сам і бачите човен")
                print("На ньому є мотор. Але бензину немає")
                print("Також ви знайшли весла. Але ви зламали руку при падінні")
                print("1. Спробувати знайти бензин на острові.")
                print("2. Спробувати веслами дістатися до ближнього острова.")
                        
        elif c == '2':
                print("Ви ідете по пляжу сам і бачете човен")
                print("На ньому є мотор. Але бензину немає")
                print("Також ви знайшли весла. Але ви зламали руку при падінні")
                print("Тепер у вас є два варіанти:")
                print("1. Спробувати знайти бензин на острові.")
                print("2. Спробувати веслами дістатися до ближнього острова.")
        d = input("Введіть свою відповідь (1/2): ")
        if d == '1':
                print("Ви розпочинаєте пошуки бензину на острові.")
                print("Знаходження бензину виявляється непростим завданням.")
                print("Час спливає, і ви вирішуєте повертатися до човна.")
        elif d == '2':
                print("Ви вирішуєте взяти весла і спробувати дістатися до ближнього острова.")
                print("На горизонті ви бачите, як до вас біжить ваша спутниця.")
                print("Ви з надією сподіваєтесь, що вона допоможе гребсти.")
                print("Вона нападає на вас з ножем.")
                print("У вас є вибір:")
                print("1. Спробувати втекти.")
                print("2. Відбиватись.")
        c = input("Виберіть відповідь: ")

        if c == '1':
                print("Ви були занадто повільним.")
                print("Вам забили ніж в спину.")
                print("Ви мертві.")
        elif c == '2':
                print("Ви відключили її веслом.")
                print("Ви зв'язали її та почали обшукувати її сумку.")
                print("Ви знайшли сірники. Все стало ясно! Саме вона підпалила той будиночок.")
                print("Які будуть ваші дії далі?")
                print("1. Розпалити сигнальний вогонь за допомогою знайдених сірників.")
                print("2. Погрожуючи вашій спутниці ножем - заставити її гребсти замість вас веслами.")
        f = input("Вкажіть ваш варіант відповіді 1/2: ")

        if f == '1':
                print("Ви розпалили вогонь.")
                print("Ви чуєте шум, який наближається зі сторони острова.")
                print("Аборигени знайшли вас.")
                print("Ви були смачний. :)")
                break
        elif f == '2':
                print("Ви врятовані. Ви знайшли цивілізацію.")
                print("А ваша спутниця була аборигеном.")